---
kind: property
id: P:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionPatternMirror
source: html/097e121c-7a54-157c-9556-1f1ee1331216.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionPatternMirror Property

Whether pattern defined by the division rule should be mirrored before application
 Mirroring is similar to changing indices of u-const gridlines.

## Syntax (C#)
```csharp
public bool DivisionPatternMirror { get; set; }
```